---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointElementHostedOnFaceUParam
source: html/78a9fd54-4d3d-c80c-50ac-a7a835d6ccd6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointElementHostedOnFaceUParam Property

"Hosted U Parameter"

## Syntax (C#)
```csharp
public static ForgeTypeId PointElementHostedOnFaceUParam { get; }
```